# таблица 1
# для обмерных работ одноэтажных зданий
tab1 = [
    # 1-ая категория сложности работ
    [[383.8, 366.4, 348.6, 330.6, 312.4, 294.8, 277.4, 259.8, 242, 223.6, 205.6, 188.2, 170.4, 152, 134.2, 124.8, 106.6,
      81.4],
     [430.2, 411, 392, 373.4, 354.8, 335.4, 316.6, 298.2, 278.6, 260, 241, 222, 203, 184, 164.8, 146.2,
      127, 108.6],
     [475, 455, 435, 414.6, 394.4, 374, 354.2, 334.2, 314, 294, 273.8, 253.8, 234, 213.6, 193.4, 173.2,
      153.8, 133]],
    # 2-ая категория сложности работ
    [[590, 565.6, 541, 516.6, 492, 466.8, 426.2, 418, 394.4, 368.6, 343.8, 319.2, 294.8, 270.2, 245.4,
      220.6, 195.6, 171.4],
     [718.6, 688.8, 659.2, 628.4, 597.8, 567.4, 536.8, 506.2, 475.6, 444.4, 413.6, 382.8, 352.8, 321.8,
      292.2, 259.2, 229.6, 198.8],
     [873.4, 838.6, 802, 765.6, 728.6, 694, 656, 619.6, 583.8, 547.2, 511, 474.8, 438.6, 401.4, 364.6,
      328.6, 292, 256]],
    # 3-я категория сложности работ
    [[711.4, 684.4, 657.2, 629.8, 602.8, 575.2, 547.8, 512.6, 485.4, 458.4, 431.4, 403.4, 376.2, 349.2,
      322.6, 294, 267, 240],
     [852, 818, 784.4, 750.6, 717.4, 683.8, 649.2, 614.4, 580.4, 546.8, 504.6, 470, 436.8, 402.6, 369.2,
      335, 301.4, 267.6],
     [946.8, 909.4, 873.2, 837.8, 801.6, 765.6, 729, 692.8, 657.2, 621.4, 585.8, 549.8, 504.8, 468.6,
      432.6, 396.1, 361.4, 323.6]]
]

# таблица 2
# для обмерных работ многоэтажных зданий
tab2 = [
    # 1-ая категория сложности работ
    [[409.2, 389.6, 369.2, 349, 328.6, 308, 288, 268.4, 243.2, 227, 206.6, 185.2, 165.4, 145.6, 124.8, 105],
     [465, 443.2, 421, 399.4, 377.8, 355.6, 333.4, 311.8, 289.9, 267.8, 245.4, 223.4, 201.4, 179.4, 157,
      105],
     [515.2, 491, 468, 444.8, 420.8, 397.8, 374.4, 351.6, 327.8, 304.2, 280.6, 257.2, 233.6, 210.2, 186.4,
      163]],
    # 2-ая категория сложности работ
    [[661.4, 634.6, 608, 581, 554.6, 528, 500.8, 473.8, 446.8, 419.8, 393.4, 361, 338.4, 311.2, 284.2,
      256.6],
     [787.4, 754.8, 722.4, 690.4, 657.6, 624.4, 591, 558.8, 526.4, 493, 459.4, 426.6, 393.4, 359.8, 327,
      294.4],
     [916.6, 879.4, 842, 804.2, 767.4, 729.4, 696.4, 654.2, 616.4, 579, 541.4, 503, 466, 420, 391.6,
      355.2]],
    # 3-я категория сложности работ
    [[771.4, 742, 711.8, 681.2, 650.6, 621, 590, 559.6, 529, 498.6, 468.2, 436.8, 406.4, 375.2, 344.6,
      312.4],
     [883.2, 851.2, 818.4, 785.2, 752.8, 719.4, 686, 653, 620.2, 586, 552.6, 519.2, 485.4, 452.6, 418.6,
      385.2],
     [962.8, 929.6, 895.2, 861.4, 828, 794.2, 760.6, 726.8, 692.4, 658.4, 623.6, 590.2, 555.6, 520.6,
      486.6, 452.6]]
]

# таблица 3
# для обследований одноэтажных зданий
tab3 = [
    # 1-ая категория сложности работ
    [[381.6, 364.6, 347.4, 330, 312.8, 296, 279.6, 261.8, 244.4, 227.6, 210.4, 193.4, 176.2, 159.2, 142.2,
      125.2, 108.6, 91.2],
     [444.6, 424.6, 405.6, 386, 366.8, 347.8, 328.4, 312, 289.2, 269.8, 251, 231.4, 212, 192.6, 173.4,
      154.4, 135.2, 115.8],
     [496.4, 475.8, 455, 433.8, 412.8, 392.8, 371.8, 350.4, 329.6, 308.6, 287.8, 267.2, 246.6, 225.6,
      204.4, 183.8, 163.8, 142.2]],
    # 2-ая категория сложности работ
    [[579.8, 563.2, 546.4, 530.2, 513.6, 496.8, 480.2, 463.6, 446.6, 429.8, 413, 397.2, 380.6, 363.6, 347.2,
      330.6, 314.2, 298],
     [643.2, 626.6, 609.8, 593, 576.4, 559.6, 542.8, 526, 509, 492.6, 475.6, 459.2, 442.2, 425.4, 408.8,
      391.8, 375.4, 358.2],
     [715.2, 699.2, 682.2, 665.8, 649.2, 632.6, 616.2, 600, 583.6, 566.8, 550.4, 534, 517.6, 501.2, 485,
      468.6, 452, 436]],
    # 3-я категория сложности работ
    [[691.6, 668.4, 644.6, 621, 597.8, 570.6, 551, 527.8, 504.4, 481.2, 458, 436.2, 412, 388.6, 365.2,
      341.8, 319, 295.6],
     [799.2, 775, 750, 725, 700.4, 676, 651, 625.8, 600.8, 576.2, 551.8, 526.8, 501.4, 477.6, 453, 428.2,
      403.4, 378.6],
     [910.2, 883, 855.8, 829, 801.6, 774.6, 747.6, 720.2, 693, 666, 639.6, 611.4, 584, 556.8, 529.6,
      502.6, 475.4, 452.6]]
]

# таблица 4
# для обследований многоэтажных зданий
tab4 = [
    # 1-ая категория сложности работ
    [[298.8, 287, 275.2, 263.8, 251.8, 239.8, 228.6, 216.4, 196.4, 192.8, 181.2, 171, 157.4, 145.6, 134,
      122],
     [338.8, 325.6, 312.2, 298.2, 285, 271.6, 258.2, 244.6, 230.6, 217, 203.8, 190.2, 176.6, 163, 149.6,
      136],
     [392.4, 377, 361, 345.4, 329.4, 314.2, 298.4, 283, 267, 251.2, 236, 220.2, 204.8, 189, 172.8, 157.4]],
    # 2-ая категория сложности работ
    [[587.4, 570, 551.8, 533.8, 516, 498, 479.6, 461.4, 443, 424.6, 406.8, 389.2, 370.8, 352.4, 334.6, 317],
     [659.8, 641.8, 623.6, 604.8, 587, 568.4, 550, 532, 513.2, 495, 476.4, 458.2, 440, 421.8, 403.4, 386.2],
     [732, 714.4, 696.4, 678.4, 664.2, 642.2, 625.2, 607.6, 589.6, 571.8, 553.8, 536.2, 518, 499.8, 481.2,
      464.4]],
    # 3-я категория сложности работ
    [[701.8, 681.6, 664.8, 641.2, 621, 600.8, 581, 560.4, 540.6, 520.8, 500.6, 480.4, 460.2, 440, 419.4,
      400.4],
     [780.8, 760.2, 739.4, 717.4, 698.4, 677.6, 657.6, 637, 618.4, 596.2, 575.4, 555.2, 534.4, 514, 493.4,
      473.8],
     [927.8, 904.4, 880.6, 856.8, 833.4, 810.4, 786.8, 763.6, 739.8, 716.8, 692.6, 669.8, 645.8, 622.2,
      599, 575.8]]
]

# таблица 5
# My, Mq, Mc от Фи {Фи:[My, Mq, Mc], }
tab5 = {0: [0, 1, 3.14], 1: [0.01, 1.06, 3.23], 2: [0.03, 1.12, 3.32],
        3: [0.04, 1.18, 3.41], 4: [0.06, 1.25, 3.51], 5: [0.08, 1.32, 3.61],
        6: [0.1, 1.39, 3.71], 7: [0.12, 1.47, 3.82], 8: [0.14, 1.55, 3.93],
        9: [0.16, 1.64, 4.05], 10: [0.18, 1.73, 4.17], 11: [0.21, 1.83, 4.29],
        12: [0.23, 1.94, 4.42], 13: [0.26, 2.05, 4.55], 14: [0.29, 2.17, 4.69],
        15: [0.32, 2.3, 4.84], 16: [0.36, 2.43, 4.99], 17: [0.39, 2.57, 5.15],
        18: [0.43, 2.73, 5.31], 19: [0.47, 2.89, 5.48], 20: [0.51, 3.06, 5.66],
        21: [0.56, 3.24, 5.84], 22: [0.61, 3.44, 6.04], 23: [0.66, 3.65, 6.24],
        24: [0.72, 3.87, 6.45], 25: [0.78, 4.11, 6.67], 26: [0.84, 4.37, 6.9],
        27: [0.91, 4.64, 7.14], 28: [0.98, 4.93, 7.4], 29: [1.06, 5.25, 7.67],
        30: [1.15, 5.59, 7.95], 31: [1.24, 5.95, 8.24], 32: [1.34, 6.34, 8.55],
        33: [1.44, 6.76, 8.88], 34: [1.55, 7.22, 9.22], 35: [1.68, 7.71, 9.58],
        36: [1.81, 8.24, 9.97], 37: [1.95, 8.81, 10.37], 38: [2.11, 9.44, 10.8],
        39: [2.28, 10.11, 11.25], 40: [2.46, 10.85, 11.73], 41: [2.66, 11.64, 12.24],
        42: [2.88, 12.51, 12.79], 43: [3.12, 13.46, 13.37], 44: [3.38, 14.5, 13.98],
        45: [3.66, 15.64, 14.64]}

# таблица 15 для инженерных систем
tab_15_1 = [
    (1000, 0.6), (2000, 0.9), (4000, 1.0), (8000, 2.2),
    (12000, 2.8), (16000, 3.5), (24000, 4.3), (32000, 5.1), (40000, 5.6)
]

tab_15_2 = [
    (1000, 0.9), (3000, 1.5), (5000, 2.5), (10000, 3.3), (15000, 4.0), (20000, 4.9)
]

tab_15_3 = [
    (1000, 0.7), (2000, 1.0), (4000, 1.4), (8000, 2.4),
    (12000, 3.1), (16000, 3.9), (24000, 4.8), (32000, 5.7), (40000, 6.2)
]

tab_15_4 = [
    (1000, 1.0), (3000, 2.2), (5000, 3.5), (10000, 4.4), (15000, 5.2), (20000, 6.6)
]

tab_15_5 = [
    (1000, 1.0), (3000, 2.2), (5000, 3.5), (10000, 4.4), (15000, 5.2), (20000, 6.6)
]

tab_15_6 = [
    (1000, 0.6), (2000, 0.8), (4000, 1.1), (8000, 1.9),
    (12000, 2.5), (16000, 3.1), (24000, 3.8), (32000, 4.6), (40000, 5.0)
]

tab_15_7 = [
    (1000, 0.4), (3000, 0.9), (5000, 1.5), (10000, 1.9), (15000, 2.2), (20000, 2.7)
]

tab_project = {
'Таблица № 1. Жилые дома, гостиницы, общежития':[
{"id": 101, "name": 'Жилые дома, одноэтажные', "unit": "м3"},
{"id": 102, "name": 'Жилые дома, двухэтажные', "unit": "м3"},
{"id": 103, "name": 'Жилые дома, трехэтажные', "unit": "м3"},
{"id": 104, "name": 'Жилые дома, четырехэтажные', "unit": "м3"},
{"id": 105, "name": 'Жилые дома, пятиэтажные', "unit": "м3"},
{"id": 106, "name": 'Жилые дома, шести - десятиэтажные', "unit": "м3"},
{"id": 107, "name": 'Жилые дома, одиннадцати - тринадцатиэтажные', "unit": "м3"},
{"id": 108, "name": 'Жилые дома, четырнадцати - шестнадцатиэтажные', "unit": "м3"},
{"id": 109, "name": 'Жилые дома, семнадцати - двадцатиэтажные', "unit": "м3"},
{"id": 110, "name": 'Жилые дома, свыше 20 этажей', "unit": "м3"},
{"id": 111, "name": 'Молодежные гостиницы, дома-интернаты на: 100-500 мест', "unit": "место"},
{"id": 112, "name": 'Гостиницы «три звезды», на: 100-500 мест', "unit": "место"},
{"id": 113, "name": 'Мотели, общежития на: 100-500 мест', "unit": "место"}
],

'Таблица № 2. Объекты здравоохранения и отдыха':[
{"id": 201, "name": 'Здания лечебные (больницы, родильные дома, медицинские центры, хосписы), диагностические центры, поликлиники, амбулатории, медпункты, женские консультации, фельдшерско-акушерские пункты площадью, м2: от 450 до 20000', "unit": "м2"},
{"id": 202, "name": 'Хозяйственные корпуса больницы, родильные дома, диспансеры (пищеблоки, прачечные), патологоанатомические корпуса, аптеки, станции скорой медицинской помощи, санитарно-эпидемиологические станции, станции переливания крови и другие строительным объемом, м3: от 1200 до 15000', "unit": "м3"},
{"id": 203, "name": 'Спортивно-оздоровительные учреждения общей площадью, м: от 2000 до 8000', "unit": "м2"},
{"id": 204, "name": 'Спальные корпуса санаториев, домов отдыха', "unit": "м2"},
{"id": 205, "name": 'Административно-приемные корпуса', "unit": "м2"}
],

'Таблица № 3. Физкультурно-спортивные объекты':[
{"id": 301, "name": 'Спортивный комплекс с залом площадью, м2: до 500', "unit": "объект"},
{"id": 302, "name": 'Спортивный комплекс с залом площадью, м2: свыше 500 до 1000', "unit": "объект"},
{"id": 303, "name": 'Спортивный комплекс с залом площадью, м2: свыше 1000 до 2000', "unit": "объект"},
{"id": 304, "name": 'Крытый легкоатлетический манеж с дорожкой длиной, м.: 160', "unit": "объект"},
{"id": 305, "name": 'Крытый легкоатлетический манеж с дорожкой длиной, м.: 200', "unit": "объект"},
{"id": 306, "name": 'Крытый легкоатлетический манеж с дорожкой длиной, м.: 400', "unit": "объект"},
{"id": 307, "name": 'Крытый велотрек с длиной дорожки 250 м.', "unit": "объект"},
{"id": 308, "name": 'Павильон - раздевальня', "unit": "м3"},
{"id": 309, "name": 'Плавательный бассейн площадью, м2: до 1000', "unit": "объект"},
{"id": 310, "name": 'Детский бассейн', "unit": "объект"},
{"id": 311, "name": 'Лыжная база на 250 - 500 спортсменов', "unit": "объект"},
{"id": 312, "name": 'Крытый каток (без трибун) площадью 2210 м2', "unit": "объект"},
{"id": 313, "name": 'Трибуна с подтрибунными помещениями до 1000 мест', "unit": "объект"},
{"id": 314, "name": 'Эллинг для хранения судов (блок 30x6 м)', "unit": "объект"},
{"id": 315, "name": 'Хозяйственный корпус строительным объемом, м3: до 3000', "unit": "м3"},
{"id": 316, "name": 'Дворец спорта до 10 тыс.мест', "unit": "1000 мест"}
],

'Таблица № 4. Объекты образования, дошкольные учреждения':[
{"id": 401, "name": 'Детский сад-ясли', "unit": "м2"},
{"id": 402, "name": 'Специальный детский сад-ясли для больных детей', "unit": "м2"},
{"id": 403, "name": 'Общеобразовательные школы, лицеи, гимназии, школы, интернаты, школы искусств, дома детского творчества, колледжи', "unit": "м2"},
{"id": 404, "name": 'Специальные школы-интернаты для больных детей', "unit": "м2"},
{"id": 405, "name": 'Спальные корпуса школ и интернатов, общежития для студентов', "unit": "м2"},
{"id": 406, "name": 'Учебные корпуса высших учебных заведений, колледжей', "unit": "м2"}
],

'Таблица № 5. Объекты культуры и искусства':[
{"id": 501, "name": 'Кинотеатры', "unit": "1 место"},
{"id": 502, "name": 'Летние кинотеатры', "unit": "1 место"},
{"id": 503, "name": 'Клубы, дома культуры', "unit": "1 место"},
{"id": 504, "name": 'Музеи, выставочные залы', "unit": "тыс.м3"},
{"id": 505, "name": 'Театры', "unit": "1 место"},
{"id": 506, "name": 'Залы универсального назначения', "unit": "1 место"},
{"id": 507, "name": 'Цирки', "unit": "1 место"},
{"id": 508, "name": 'Библиотеки, архивы', "unit": "тыс.томов"}
],

'Таблица № 6. Научно-исследовательские учреждения, проектные и конструкторские организации':[
{"id": 601, "name": 'Лабораторно-исследовательские здания', "unit": "м2"},
{"id": 602, "name": 'Здания опытно-экспериментальных исследований', "unit": "м2"},
{"id": 603, "name": 'Административные здания', "unit": "м2"},
{"id": 604, "name": 'Хозяйственные здания строительным объемом, м3: от 1200 до 15000', "unit": "м3"}
],

'Таблица № 7. Объекты коммунального обслуживания населения':[
{"id": 701, "name": 'Коммунальные прачечные', "unit": "т/смена"},
{"id": 702, "name": 'Бани гигиенического типа', "unit": "1 место"},
{"id": 703, "name": 'Бани оздоровительного типа', "unit": "1 место"},
{"id": 704, "name": 'Здание траурных гражданских обрядов', "unit": "м2"},
{"id": 705, "name": 'Административно-бытовой корпус кладбища', "unit": "м2"}
],

'Таблица № 8. Объекты водоснабжения и водоотведения':[
{"id": 801, "name": 'Городской водопровод, сооружаемый открытым способом с диаметром трубы до 315 мм, протяженностью, м: от 100 до 1000', "unit": "м"},
{"id": 802, "name": 'Городской водопровод, сооружаемый открытым способом с диаметром трубы до 315 мм, протяженностью, м: от 1000 до 2000', "unit": "м"},
{"id": 803, "name": 'Городской водопровод, сооружаемый открытым способом с диаметром трубы до 315 мм, протяженностью, м: от 2000 до 5000', "unit": "м"},
{"id": 804, "name": 'Городской водопровод, сооружаемый открытым способом с диаметром трубы до 315 мм, протяженностью, м: свыше 5000', "unit": "м"},
{"id": 805, "name": 'Городской водопровод, сооружаемый открытым способом с диаметром трубы  свыше 315 мм до 630 мм, протяженностью, м: от 100 до 1000', "unit": "м"},
{"id": 806, "name": 'Городской водопровод, сооружаемый открытым способом с диаметром трубы  свыше 315 мм до 630 мм, протяженностью, м: от 1000 до 2000', "unit": "м"},
{"id": 807, "name": 'Городской водопровод, сооружаемый открытым способом с диаметром трубы  свыше 315 мм до 630 мм, протяженностью, м: от 2000 до 5000', "unit": "м"},
{"id": 808, "name": 'Городской водопровод, сооружаемый открытым способом с диаметром трубы  свыше 315 мм до 630 мм, протяженностью, м: свыше 5000', "unit": "м"},
{"id": 809, "name": 'Городской водопровод, сооружаемый открытым способом с диаметром трубы  свыше 630 мм, протяженностью, м: от 100 до 1000', "unit": "м"},
{"id": 810, "name": 'Городской водопровод, сооружаемый открытым способом с диаметром трубы  свыше 630 мм, протяженностью, м: от 1000 до 2000', "unit": "м"},
{"id": 811, "name": 'Городской водопровод, сооружаемый открытым способом с диаметром трубы  свыше 630 мм, протяженностью, м: от 2000 до 5000', "unit": "м"},
{"id": 812, "name": 'Городской водопровод, сооружаемый открытым способом с диаметром трубы  свыше 630 мм, протяженностью, м: свыше 5000', "unit": "м"},
{"id": 813, "name": 'Канализация (бытовая, дождевая, общесплавная), сооружаемая открытым способом диаметром до 300 мм, протяженностью, м: от 100 до 500', "unit": "м"},
{"id": 814, "name": 'Канализация (бытовая, дождевая, общесплавная), сооружаемая открытым способом диаметром до 300 мм, протяженностью, м: свыше 500', "unit": "м"},
{"id": 815, "name": 'Канализация, сооружаемая открытым способом диаметром от 300 до 500 мм, протяженностью, м: от 100 до 1000', "unit": "м"},
{"id": 816, "name": 'Канализация, сооружаемая открытым способом диаметром от 300 до 500 мм, протяженностью, м: свыше 1000 до 5000', "unit": "м"},
{"id": 817, "name": 'Канализация, сооружаемая открытым способом диаметром свыше 500 до 1000 мм, протяженностью, м: от 100 до 1000', "unit": "м"},
{"id": 818, "name": 'Канализация, сооружаемая открытым способом диаметром свыше 500 до 1000 мм, протяженностью, м: свыше 1000 до 5000', "unit": "м"},
{"id": 819, "name": 'Канализация, сооружаемая открытым способом диаметром свыше 500 до 1000 мм, протяженностью, м: свыше 5000', "unit": "м"},
{"id": 820, "name": 'Канализация, сооружаемая открытым способом диаметром свыше 1000 мм, протяженностью, м: от 100 до 1000', "unit": "м"},
{"id": 821, "name": 'Канализация, сооружаемая открытым способом диаметром свыше 1000 мм, протяженностью, м: свыше 1000 до 5000', "unit": "м"},
{"id": 822, "name": 'Канализация, прокладываемая методом горизонтального направленного бурения, протяженностью, м: от 100 до 1000', "unit": "м"},
{"id": 823, "name": 'Канализация, прокладываемая методом прессошнекового бурения, протяженностью, м: от 100 до 1000', "unit": "м"}
],

'Таблица № 9. Объекты энергоснабжения':[
{"id": 901, "name": 'Кабельные линии напряжением менее 35 кВ', "unit": "м"},
{"id": 902, "name": 'Блочное водоотведение (для электрокабелей)', "unit": "м"},
{"id": 903, "name": 'Здания административные', "unit": "м2"},
{"id": 904, "name": 'Здания складов (ЛВЖ, оборудования, химикатов)', "unit": "м2"},
{"id": 905, "name": 'Здания энергетических установок', "unit": "м2"},
{"id": 906, "name": 'Двухцепная кабельная линия напряжением 110 кВ', "unit": "м"},
{"id": 907, "name": 'Наружное освещение длиной, п.м.: от 250 до 1000', "unit": "п.м."},
{"id": 908, "name": 'Наружное освещение длиной, п.м.: свыше 1000 до 3000', "unit": "п.м."},
{"id": 909, "name": 'Наружное освещение длиной, п.м.:  свыше 3000 до 5000', "unit": "п.м."},
{"id": 910, "name": 'Наружное освещение длиной, п.м.: свыше 5000 до 10000', "unit": "п.м."}
],

'Таблица № 10. Объекты теплоснабжения':[
{"id": 1001, "name": 'Тепловая сеть в двухтрубном исчислении при бесканальной прокладке без дренажа диаметром трубопровода, мм: 50', "unit": "1 км."},
{"id": 1002, "name": 'Диаметром трубопровода, мм: 80', "unit": "1 км."},
{"id": 1003, "name": 'Диаметром трубопровода, мм: 100', "unit": "1 км."},
{"id": 1004, "name": 'Диаметром трубопровода, мм: 150', "unit": "1 км."},
{"id": 1005, "name": 'Диаметром трубопровода, мм: 200', "unit": "1 км."},
{"id": 1006, "name": 'Диаметром трубопровода, мм: 250', "unit": "1 км."},
{"id": 1007, "name": 'Диаметром трубопровода, мм: 300', "unit": "1 км."},
{"id": 1008, "name": 'Диаметром трубопровода, мм: 350', "unit": "1 км."},
{"id": 1009, "name": 'Диаметром трубопровода, мм: 400', "unit": "1 км."},
{"id": 1010, "name": 'Диаметром трубопровода, мм: 450', "unit": "1 км."},
{"id": 1011, "name": 'Диаметром трубопровода, мм: 500', "unit": "1 км."},
{"id": 1012, "name": 'Диаметром трубопровода, мм: 600', "unit": "1 км."},
{"id": 1013, "name": 'Диаметром трубопровода, мм: 700', "unit": "1 км."},
{"id": 1014, "name": 'Диаметром трубопровода, мм: 800', "unit": "1 км."},
{"id": 1015, "name": 'Диаметром трубопровода, мм: 900', "unit": "1 км."},
{"id": 1016, "name": 'Диаметром трубопровода, мм: 1000', "unit": "1 км."},
{"id": 1017, "name": 'Диаметром трубопровода, мм: 1200', "unit": "1 км."},
{"id": 1018, "name": 'Диаметром трубопровода, мм: 1400', "unit": "1 км."}
]
}

tab_project_2 = {101:[60.0, 0.01, 'м3'], 102:[90.0, 0.01, 'м3'], 103:[135.0, 0.01, 'м3'], 104:[200.0, 0.006, 'м3'], 105:[275.0, 0.006, 'м3'], 106:[450.0, 0.006, 'м3'], 107:[500.0, 0.007, 'м3'],
108:[650.0, 0.02, 'м3'], 109:[800.0, 0.06, 'м3'], 110:[1000.0, 0.07, 'м3'], 111:[350.0, 2.0, 'место'],
112:[420.0, 2.2, 'место'], 113:[280.0, 1.5, 'место'],

201:[230.0, 0.12, 'м2'], 202:[100.0, 0.03, 'м3'], 203:[410.0, 0.13, 'м2'], 204:[120.0, 0.07, 'м2'], 205:[70.0, 0.07, 'м2'],

301:[125.0, 0, 'объект'], 302:[160.0, 0, 'объект'], 303:[261.0, 0, 'объект'], 304:[462.0, 0, 'объект'], 305:[466.0, 0, 'объект'], 306:[478.0, 0, 'объект'], 307:[600.0, 0, 'объект'], 308:[35.0, 0.03, 'м3'], 309:[460.0, 0, 'объект'], 310:[320.0, 0, 'объект'], 311:[80.0, 0, 'объект'], 312:[400.0, 0, 'объект'], 313:[110.0, 0, 'объект'], 314:[50.0, 0, 'объект'], 315:[85.0, 0.015, 'м3'], 316:[2207.5, 225.5, '1000 мест'],

401:[70.0, 0.2, 'м2'], 402:[85.0, 0.23, 'м2'], 403:[226.0, 0.08, 'м2'], 404:[285.0, 0.04, 'м2'], 405:[95.0, 0.01, 'м2'], 406:[250.0, 0.36, 'м2'],

501:[210.0, 0.46, '1 место'], 502:[60.0, 0.15, '1 место'], 503:[220.0, 1.5, '1 место'], 504:[600.0, 60.0, 'тыс.м3'], 505:[500.0, 1.6, '1 место'], 506:[750.0, 0.6, '1 место'], 507:[600.0, 0.35, '1 место'], 508:[140.0, 0.7, 'тыс.томов'],

601:[660.0, 0.21, 'м2'], 602:[860.0, 0.47, 'м2'], 603:[70.0, 0.07, 'м2'], 604:[100.0, 0.03, 'м3'],

701:[110.0, 65.0, 'т/смена'], 702:[32.0, 2.2, '1 место'], 703:[149.0, 1.8, '1 место'], 704:[0, 1.9, 'м2'], 705:[132.8, 0.05, 'м2'],

801:[8.4, 0.095, 'м'], 802:[63.0, 0.041, 'м'], 803:[100.8, 0.022, 'м'], 804:[139.3, 0.14, 'м'], 805:[17.67, 0.128, 'м'], 806:[63.87, 0.082, 'м'], 807:[143.67, 0.042, 'м'], 808:[227.67, 0.025, 'м'], 809:[14.8, 0.178, 'м'], 810:[99.5, 0.094, 'м'], 811:[203.1, 0.042, 'м'], 812:[287.1, 0.025, 'м'], 813:[23.1, 0.09, 'м'], 814:[38.85, 0.058, 'м'], 815:[38.53, 0.149, 'м'], 816:[103.63, 0.084, 'м'], 817:[53.48, 0.22, 'м'], 818:[151.48, 0.12, 'м'], 819:[396.48, 0.07, 'м'], 820:[68.18, 0.29, 'м'], 821:[159.18, 0.2, 'м'], 822:[33.46, 0.126, 'м'], 823:[99.12, 0.126, 'м'],

901:[6.2, 0.09, 'м'], 902:[18.6, 0.1, 'м'], 903:[262.0, 0.14, 'м2'], 904:[133.0, 0.12, 'м2'], 905:[250.0, 0.3, 'м2'], 906:[136.4, 0.35, 'м'], 907:[18.2, 0.044, 'п.м.'], 908:[53.18, 0.009, 'п.м.'], 909:[59.48, 0.007, 'п.м.'], 910:[66.48, 0.006, 'п.м.'],

1001:[10.17, 98.0, '1 км.'], 1002:[11.02, 106.21, '1 км.'], 1003:[12.54, 120.82, '1 км.'], 1004:[13.38, 128.89, '1 км.'], 1005:[14.45, 140.2, '1 км.'], 1006:[16.52, 160.27, '1 км.'], 1007:[19.8, 192.13, '1 км.'], 1008:[20.9, 202.8, '1 км.'], 1009:[23.25, 225.6, '1 км.'], 1010:[26.4, 255.98, '1 км.'], 1011:[26.92, 261.18, '1 км.'], 1012:[30.92, 299.97, '1 км.'], 1013:[34.06, 330.6, '1 км.'], 1014:[39.02, 378.7, '1 км.'], 1015:[45.92, 445.58, '1 км.'], 1016:[48.49, 470.55, '1 км.'], 1017:[62.29, 604.39, '1 км.'], 1018:[73.29, 711.07, '1 км.'],
}